{
    "Education": [
        {
            "school": "university of wisconsin-madison",
            "degree": "Master of Science - MS",
            "major": "Computer Science",
            "period": "2021 – 2023"
        },
        {
            "school": "National Taiwan University",
            "degree": "Bachelor's degree",
            "major": "Economics",
            "period": "2010 – 2015"
        }
    ],
    "Experience": [
        {
            "title": "Data Analyst / Engineer",
            "company": "Cathay United Bank",
            "period": "Jan 2019 – Dec 2020",
            "description": "* Generate data for 6000 users in Cathay United Bank\nComprehend business logic, turning raw data into meaningful information for business units across the entire bank.\n- Discuss business logic with users\n- Data Wrangling with SQL\n- Use perl and ETL tools to deliver data across multiple system\n- Visiualize data via python or BI tools like Cognos or Tableau\n\n* Collect anonymous customer behavior and turn it into insight\nIn charge of Celebrus (online data collecting tool similar with GA).\n- Monitor server side issue\n- Design, maintain and adjust ETL job flows\n- Use data to make funnel analysis, helping build a marketing strategy\n- Use data to design A/B testing on web pages, optimizing content on websites\n- Use data to identify anonymous user, enabling sales unit to reach them\n\n* Build investing strategy / model for trading room\nCooperate with traders and leverage market data into profitable investing strategy / model\n- Use SQL / python to combine various source of financial data\n- Design back testing algorithm\n- Design rule-based trading strategy\n- Design trading models using deep learning technique like LSTM to address Time Series Forecasting\n…\nsee more"
        },
        {
            "title": "台灣人工智慧學校",
            "company": "AiAcademy",
            "period": "Jul 2019 – Nov 2019",
            "description": "A part-time bootcamp focusing on machine learning and deep learning. The curriculum covered from basic linear regression model to latest neural network model. We did several Kaggle competition to practice implementing and tuning model. In the final project, we adopt keras and built a mode to predict the interval of stock price.\n…\nsee more"
        },
        {
            "title": "Data Engineer",
            "company": "Tixguru",
            "period": "Aug 2018 – Dec 2018",
            "description": "Tixguru inc. is a startup company providing online automated trading service.\n* Create financial database and develop trading strategy from scratch\n- Get Market Data via python web scraping library\n- Design an automatic data pipeline to load raw data into database\n- Write scripts to schedule tasks on GCP\n- Design back testing code\n- Build dashboard via Elasticsearch & Kibana\n…\nsee more"
        },
        {
            "title": "Big Data 資料分析師養成班",
            "company": "中壢資策會",
            "period": "Mar 2018 – Aug 2018",
            "description": "A full-time bootcamp focusing on fundamentals of computer science and hands-on practice of data engineering / analysis.\nThe curriculum includes Linux, SQL, Java, Python, Javascript, Data Analysis, Machine Learning, Data Visualization. In the final project, we leveraged the skills above and build an online platform to evaluate reasonable house prices of certain area and provide analytic report and visualization.\n…\nsee more"
        },
        {
            "title": "Product Specialist",
            "company": "91APP, Inc.",
            "period": "Jan 2017 – Mar 2018",
            "description": "91 APP is an e-commerce solution provider that allows anyone to set up an online store on web/APP.\n* Leverage the company's product or solution (e-commerce platform services including website, app, in-store integration software, payment, customized marketing function) to enhance clients' revenue\n- Analyze sales data of clients to find composition of customer group\n- Discuss with clients to find pain points\n- Recommend multiple marketing solution for clients in accordance with their customer segmentation\n- Design A/B testing to optimize marketing strategy\n…\nsee more"
        }
    ]
}