{
    "Education": [
        {
            "school": "Arizona State University",
            "degree": "Master of Science - MS",
            "major": "Computer Science",
            "period": "2020 – 2021"
        },
        {
            "school": "Malaviya National Insitute of Technology Jaipur",
            "degree": "Bachelor of Technology (B.Tech.)",
            "major": "Computer Science",
            "period": "2015 – 2019"
        },
        {
            "school": "Maharani Gayatri Devi Girls' School, Jaipur",
            "degree": "Marticulation",
            "major": "Science",
            "period": "2003 – 2015"
        }
    ],
    "Experience": [
        {
            "title": "Graduate Services Assistant",
            "company": "Arizona State University Part-time",
            "period": "Sep 2021 – Present",
            "description": "• Assisting professor with course material, assignments and exams for Statistical Learning (CSE569) with 140+ enrolled students.\n• Aiding students with paradigms of machine learning, inner workings of ML algorithms and challenges in machine and deep learning."
        },
        {
            "title": "Software Engineer Intern",
            "company": "Apple Internship",
            "period": "May 2021 – Aug 2021",
            "description": "• Developed an Apple Internal Research project from an idea into a proof-of-concept while leading the project planning.\n• Achieved industry benchmark in the NLP classification task using BERT model with python to conclude the project.\n• Selected as the only intern out of four by the Sr. Director to present my internship work to the Vice President of my organization.\n• Pitched the project idea for future funding to the Vice President of an Apple service.\n…\nsee more"
        },
        {
            "title": "Artificial Intelligence Developer Intern",
            "company": "Quadrical.ai Internship",
            "period": "Jul 2019 – Dec 2019",
            "description": "• Built pipelines in Python to run ensemble of customized learning models like CatBoost, support vector machine, neural networks etc. resulting in a common platform for all clients’ data.\n• Created customer dashboards for data visualization in Tableau and PowerBI for ease of access to clients.\n• Analyzed data-points and worked on feature engineering of the data to improve ensemble model accuracy\n…\nsee more"
        },
        {
            "title": "Independent Contractor",
            "company": "Fidelity Investments",
            "period": "May 2018 – Jul 2018",
            "description": "• Automated on-boarding of new customers using Java and DFC for back-end and Microsoft PowerApps for front-end and henceforth reducing manual labor of 1200-1500 hours ($100,000 - $150,000) per year.\n• Yielded further improvement in terms of saving time by adding a recommender system to the application.\n…\nsee more"
        },
        {
            "title": "Summer Intern",
            "company": "NetElixir Internship",
            "period": "May 2017 – Jun 2017",
            "description": "• Developed a python pipeline for comparison of various machine learning algorithms like linear and logistic regressions, support vector machine, random forest etc. to shift the Search Engine Marketing paradigm from logic-based to learning-based implementation.\n• Adapted design changes for NetElixir blog for a better customer experience.\n…\nsee more"
        }
    ]
}