{
    "Education": [
        {
            "school": "Carnegie Mellon University",
            "degree": "Master's degree",
            "major": "Information System Management",
            "period": "2021-2022"
        },
        {
            "school": "National Chiao Tung University",
            "degree": "Bachelor's degree",
            "major": "Computer Science",
            "period": "2016-2020"
        }
    ],
    "Experience": [
        {
            "title": "Software Engineer/Program Manager Intern",
            "company": "Microsoft",
            "period": "Jul 2020 - Jul 2021",
            "description": "• Designed three repair recommendations that could help 40K+ advertisers locate and fix issues\n• Constructed evaluation (Python) to measure quality of audience suggestion service; identified two metrics to be improved\n• Cooperated with engineers and PMs to design image recommendation feature; analyzed relationship between image usage and ad performance using TB level data (SQL, C#)\n• Performed data analysis to identify cause of performance issue for 10+ customers; formulated SOP to increase work efficiency\n• Composed spec to support two new bidding strategies in planning tool; collaborated with designer and multiple stakeholders\n• Created dashboards (PowerBI) to monitor demand health and performance of each market; built data pipelines to acquire needed information; documented source and process"
        },
        {
            "title": "Software Developer Intern",
            "company": "Hewlett Packard Enterprise",
            "period": "Jul 2019 – Jun 2020",
            "description": "• Designed and developed the frontend (Angular, Typescript, CSS) of administration console.\n• Established a single entry-point for cluster management which provides information including server settings, storage size, disk status, and diagnosis messages.\n• Accumulated more than 5000 downloads since it was first released in March of 2020."
        }
    ]
}